{
  "backend/main.mo": "Motoko actor that stores contact form submissions and demo bookings in maps, exposes public functions to submit and retrieve them, and validates that all fields are non-empty.",
  "feature_evidence.json": "Feature evidence report documenting a single fix: updating the second CTA button text color in Hero.tsx to a high-contrast color for legibility in all states.",
  "frontend-file-summaries.txt": "JSON document containing one-sentence summaries of every frontend source file, describing each component's purpose and key content.",
  "frontend/index.css": "Tailwind base CSS file defining OKLCH-based CSS custom properties for light and dark theme color tokens (background, foreground, primary, chart colors, sidebar, etc.).",
  "frontend/index.html": "Minimal HTML entry point titled 'NEET Botany Mentor' that mounts the React app at the #root div and loads the main TSX module.",
  "frontend/src/App.tsx": "Root React component that assembles all page sections (Navigation, Hero, AboutMe, Services, WhyChooseMe, CourseStructure, DemoBooking, Testimonials, FAQ, Contact, Footer, WhatsAppFloat) with anchor IDs for smooth scrolling.",
  "frontend/src/components/AboutMe.tsx": "About Me section displaying mentor Kuldeep Patidar's portrait, bio (BHU B.Sc./M.Sc., 5 years at ALLEN KOTA and NARAYANA INDORE), mission statement, and qualification badges.",
  "frontend/src/components/Contact.tsx": "Contact section with phone/WhatsApp/email/location detail cards and a form that submits name, email, phone, and message to the Motoko backend, showing success or error states.",
  "frontend/src/components/CourseStructure.tsx": "Course Structure section rendering four program features (syllabus coverage, weekly tests, monthly reports, WhatsApp support) in a timeline-style grid with step circles and info cards.",
  "frontend/src/components/DemoBooking.tsx": "A React component that renders a demo class booking section with a form collecting name, phone, and preferred time, submitting via the useBookDemo mutation hook and showing a success state on completion.",
  "frontend/src/components/FAQ.tsx": "A static FAQ section component that displays a list of common questions about the NEET Botany course using a collapsible Accordion UI, with numbered items and green-themed styling.",
  "frontend/src/components/Footer.tsx": "A site footer component displaying the brand logo, quick navigation links with smooth-scroll, and contact info (phone, WhatsApp, email, location) on a dark green background.",
  "frontend/src/components/Hero.tsx": "A full-screen hero section featuring a background botany image with overlay, mentor name/title heading, CTA buttons scrolling to demo and contact sections, and three stat badges.",
  "frontend/src/components/Navigation.tsx": "A fixed top navigation bar with smooth-scroll links, a 'Free Demo' CTA button, scroll-aware background styling, and a responsive hamburger menu for mobile viewports.",
  "frontend/src/components/Services.tsx": "Renders a grid of NEET Botany tutoring service cards (e.g., mentoring, live classes, PYQ analysis) with icons, plus a CTA card that scrolls to the demo booking section.",
  "frontend/src/components/Testimonials.tsx": "Displays a placeholder testimonials section with three student review cards and a 'coming soon' notice, using star ratings and quote icons.",
  "frontend/src/components/WhatsAppFloat.tsx": "Renders a fixed floating WhatsApp button linking to a pre-filled chat message for NEET Botany mentoring inquiries.",
  "frontend/src/components/WhyChooseMe.tsx": "Displays a grid of five reasons to choose the mentoring program (e.g., NCERT expertise, personalized attention), with the first card styled as a highlighted gradient feature card.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an ICP backend actor (authenticated or anonymous) using React Query, and invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context and provider, managing login/logout state via DFINITY's AuthClient and exposing identity, login, and clear functions.",
  "frontend/src/hooks/useQueries.ts": "Exports two React Query mutation hooks—useSubmitContactForm and useBookDemo—that call the ICP backend actor to submit form data.",
  "frontend/src/index.css": "Defines global styles including Google Fonts imports, Tailwind directives, a green-and-white OKLCH CSS variable theme (light/dark), and utility classes for section headings and green gradients.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration for the frontend, extending the default theme with custom colors (green palette, WhatsApp), fonts (Merriweather/Inter), shadows, border radii, keyframe animations, and plugins (typography, container-queries, animate).",
  "project_state.json": "Project state metadata describing the KULDEEP PATIDAR NEET Botany tutoring website, including version, architectural notes, known issues, and a list of implemented features covering all major page sections."
}